- 추영빈
개발자가 아니라도 이해할 수 있게 설명하기 - 변수를 언급하는게 아니라 기능을 말하기
ppt에 텍스트가 적은게 좋은건 맞지만 아무것도 없으면 내용을 놓친 학생들은 내용을 다시 확인할 수단이 없음
간단하게라도 코멘트 넣기
넣은 자료에 대한 조사는 확실히 하기

하이어라키 뜻이 뭐에요?
유니버셜이랑 렌더 파이프는 뭐가 다른가요?
2D로 켰을때랑 3D로 켰을때랑 뭐가 달라요?
클래스가 뭔가요
상속 받는다는게 무슨 뜻이죠?
코드 입력창은 어디서 여나요

<2차시>
텍스트 배치가 잘 안보이고 불편함
뭔가 설명을 했으면 그거에 대한 예시를 좀
코드를 적었으면 바로 창을 넘기지 말고 기다리기
세미콜론 왜 넣는지 설명
프로젝트를 처음 만들었을때 기본으로 들어가있는 오브젝트들을 추가로 설명해주면 좋을듯
한정자 설명 너무 부족해! 이걸 그냥 말로 넘긴다고? 장난해?????
인스팩터 설명 안한거 같은디
설명에 주어가 좀 명확하지가 않음
코드 자동완성 설명 안해주고 자기 혼자 씀
c# 클래스 첫글자 대문자 규칙 안지키는거 많이 불편함
GameObject 설명 없음
컴포넌트 개념 구조 설명 없음
컴포넌트로 변수 접근이 되는 이유도 없음
문자열에 $로 변수 삽입하는거 설명 없음


<윤서현>
사전에 만드는 게임이 어떤건지 시각적으로 보여주는게 좋을듯
간단한 코드로 기능 추가 설명하는거 좋음 복잡한 부분은 계속 이런식으로 해주면 좋을듯
명칭들 발음 주의 SerializeField 시리얼라이즈 필드
private은 외부에서 변경 불가능한거 그냥 값을 불가능하다고 ppt에 적혀있으면 오해할 수 있음
public private protected와 같은 요소들의 명칭을 적어두는게 좋을듯 - 한정자
대본이 있는거 같은데 뭔가 잘 가다가 삐끗하는 부분이 있다랄까
Pooler에 제네릭 설명 없고 return에 대한 설명이 한번도 안 나온듯?
구조 자체가 복잡해서 주석이라도 적으면서 하는게 나을듯
일부 너무 복잡하고 이해가 안되는 함수는 기능만 설명하고 넘기는거도 괜찮음

함수 코드를 적을때 왠만하면 이해시킬 수 있는 부분만 비워서 거기만 적게 하고 나머지는 대략적인 설명으로 넘기는게 훨 나을거 같은데

